; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-5-5-3-10-10-3) (:domain depots)
(:objects
	depot0 depot1 depot2 depot3 depot4 - Depot
	distributor0 distributor1 distributor2 distributor3 distributor4 - Distributor
	truck0 truck1 truck2 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 - Pallet
	crate0 crate1 crate2 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 depot3)
	(clear pallet3)
	(at pallet4 depot4)
	(clear pallet4)
	(at pallet5 distributor0)
	(clear pallet5)
	(at pallet6 distributor1)
	(clear crate0)
	(at pallet7 distributor2)
	(clear pallet7)
	(at pallet8 distributor3)
	(clear crate2)
	(at pallet9 distributor4)
	(clear crate1)
	(at truck0 depot2)
	(at truck1 distributor1)
	(at truck2 depot2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 depot4)
	(available hoist4)
	(at hoist5 distributor0)
	(available hoist5)
	(at hoist6 distributor1)
	(available hoist6)
	(at hoist7 distributor2)
	(available hoist7)
	(at hoist8 distributor3)
	(available hoist8)
	(at hoist9 distributor4)
	(available hoist9)
	(at crate0 distributor1)
	(on crate0 pallet6)
	(at crate1 distributor4)
	(on crate1 pallet9)
	(at crate2 distributor3)
	(on crate2 pallet8)
)

(:goal (and
		(on crate0 pallet2)
		(on crate1 pallet4)
	)
))

; plan
1. (lift hoist6 crate0 pallet6 distributor1)
   deleted: (at crate0 distributor1) (available hoist6) (on crate0 pallet6) (clear crate0)
   added: (lifting hoist6 crate0) (clear pallet6)
   goals met: 0 of 2
2. (load hoist6 crate0 truck1 distributor1)
   deleted: (lifting hoist6 crate0)
   added: (in crate0 truck1) (available hoist6)
   goals met: 0 of 2
3. (lift hoist9 crate1 pallet9 distributor4)
   deleted: (at crate1 distributor4) (available hoist9) (on crate1 pallet9) (clear crate1)
   added: (lifting hoist9 crate1) (clear pallet9)
   goals met: 0 of 2
4. (drive truck1 distributor1 distributor4)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor4)
   goals met: 0 of 2
5. (load hoist9 crate1 truck1 distributor4)
   deleted: (lifting hoist9 crate1)
   added: (in crate1 truck1) (available hoist9)
   goals met: 0 of 2
6. (drive truck1 distributor4 depot4)
   deleted: (at truck1 distributor4)
   added: (at truck1 depot4)
   goals met: 0 of 2
7. (unload hoist4 crate1 truck1 depot4)
   deleted: (available hoist4) (in crate1 truck1)
   added: (lifting hoist4 crate1)
   goals met: 0 of 2
8. (drive truck1 depot4 depot2)
   deleted: (at truck1 depot4)
   added: (at truck1 depot2)
   goals met: 0 of 2
9. (unload hoist2 crate0 truck1 depot2)
   deleted: (available hoist2) (in crate0 truck1)
   added: (lifting hoist2 crate0)
   goals met: 0 of 2
10. (drop hoist2 crate0 pallet2 depot2)
   deleted: (lifting hoist2 crate0) (clear pallet2)
   added: (at crate0 depot2) (available hoist2) (on crate0 pallet2) (clear crate0)
   goals met: 1 of 2
11. (drop hoist4 crate1 pallet4 depot4)
   deleted: (lifting hoist4 crate1) (clear pallet4)
   added: (at crate1 depot4) (available hoist4) (on crate1 pallet4) (clear crate1)
   goals met: 2 of 2
